# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources in the README.md file
- Happy learning!

# Challenge 1 - Accessing our database
Create a connection to access the sakila database with the ip, user and password provided in class. Take a look at the data. Do some joins in order to have more elaborated tables in a dataframe (you can try first the query in the DBMS and then use it in your notebook).

In [156]:
# your code here
!conda install -y sqlalchemy
from sqlalchemy import create_engine
data_path = '/home/viki/Data/juliarochflores.db'
connection = f'sqlite:///{data_path}'
engine = create_engine(connection)

#We will need pandas installed to work with it.
import pandas as pd

#Let's see what tables are included in the database.
pd.read_sql_query("SELECT name FROM sqlite_master WHERE type='table'", engine)

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

            name
0      rank_info
1  personal_info
2  business_info

In [157]:
#Query every table to visualize the data contained.
df_rank = pd.read_sql_query("select * from rank_info", engine)
display(df_rank)

        id                         name  position  Unnamed: 0
0     6367  ananT ASAVABHOKHIN & family       NaN           0
1     7613               arash FERDOWSI       NaN           1
2     6139     banthoon LAMSAM & FAMILY       NaN           2
3     5671       bill ADDERLEY & family       NaN           3
4     2117            boris zINGArevich       NaN           4
...    ...                          ...       ...         ...
2255  4506               zhao XIAOQiang    2204.0        2255
2256  6986              zHOU LIANgzhang    2205.0        2256
2257  1828                 zhu XINGMIng    2206.0        2257
2258  6448                     ZHUO JUN    2207.0        2258
2259  1860                  olguN ZOrlu    2208.0        2259

[2260 rows x 4 columns]

In [158]:
df_personal = pd.read_sql_query("select * from personal_info", engine)
display(df_personal)

,id,lastName,age,Unnamed: 0,gender,country,image
0,8760,BEZOS,54 years old,52,None,United States,https://specials-images.forbesimg.com/imageser...
1,7500,GATES,62 years old,53,Male,None,https://specials-images.forbesimg.com/imageser...
2,5751,bufFETT,87 years old,54,M,None,https://specials-images.forbesimg.com/imageser...
3,8365,arNAULt,69 years old,55,None,France,https://specials-images.forbesimg.com/imageser...
4,5328,zUCKERBERg,1985,56,None,United States,https://specials-images.forbesimg.com/imageser...
...,...,...,...,...,...,...,...
2203,4506,ZHAO,51 years old,2255,M,China,https://specials-images.forbesimg.com/imageser...
2204,6986,zhOU,55 years old,2256,None,None,https://specials-images.forbesimg.com/imageser...
2205,1828,zHU,51 years old,2257,M,People's Republic of China,https://specials-images.forbesimg.com/imageser...
2206,6448,ZHUO,52 years old,2258,Female,None,https://specials-images.forbesimg.com/imageser...
2207,1860,zoRLu,54 years old,2259,M,Turkey,https://specials-images.forbesimg.com/imageser...

In [159]:
df_business = pd.read_sql_query("select * from business_info", engine)
display(df_business)

,id,Unnamed: 0,Source,worth,worthChange,realTimeWorth,realTimePosition
0,8760,52,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,7500,53,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,5751,54,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,8365,55,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5328,56,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5
...,...,...,...,...,...,...,...
2203,4506,2255,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134
2204,6986,2256,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134
2205,1828,2257,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856
2206,6448,2258,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978
2207,1860,2259,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978

In [160]:
#Joining the tables to have all the important data together
#With a "simple" JOIN only the people with personal information complete appear in the df
query_total ="""
SELECT rank_info.position, rank_info.name, rank_info.id, 
personal_info.age, personal_info.gender, personal_info.country, personal_info.image, 
business_info.Source, business_info.worth, business_info.worthChange, business_info.realTimeWorth, business_info.realTimePosition
FROM rank_info
JOIN personal_info ON personal_info.id = rank_info.id
JOIN business_info ON business_info.id = rank_info.id"""
df_total = pd.read_sql_query(query_total, engine)
display(df_total)

,position,name,id,age,gender,country,image,Source,worth,worthChange,realTimeWorth,realTimePosition
0,1.0,jefF BEZOs,8760,54 years old,None,United States,https://specials-images.forbesimg.com/imageser...,Technology ==> Amazon,112.0 BUSD,0.0 millions USD,None,1
1,2.0,bILL GATES,7500,62 years old,Male,None,https://specials-images.forbesimg.com/imageser...,Technology ==> Microsoft,90.0 BUSD,-0.001 millions USD,None,2
2,3.0,WARREN BUFFEtt,5751,87 years old,M,None,https://specials-images.forbesimg.com/imageser...,Finance and Investments ==> Berkshire Hathaway,84.0 BUSD,-0.002 millions USD,None,3
3,4.0,bernARD ARNAULT,8365,69 years old,None,France,https://specials-images.forbesimg.com/imageser...,Fashion & Retail ==> LVMH,72.0 BUSD,0.0 millions USD,None,4
4,5.0,maRK ZUCKERBERG,5328,1985,None,United States,https://specials-images.forbesimg.com/imageser...,Technology ==> Facebook,71.0 BUSD,0.0 millions USD,None,5
...,...,...,...,...,...,...,...,...,...,...,...,...
2203,2204.0,zhao XIAOQiang,4506,51 years old,M,China,https://specials-images.forbesimg.com/imageser...,"Fashion & Retail ==> fashion, entertainment",1.0 BUSD,0.0 millions USD,None,2134
2204,2205.0,zHOU LIANgzhang,6986,55 years old,None,None,https://specials-images.forbesimg.com/imageser...,Manufacturing ==> electrical equipment,1.0 BUSD,nan millions USD,None,2134
2205,2206.0,zhu XINGMIng,1828,51 years old,M,People's Republic of China,https://specials-images.forbesimg.com/imageser...,Manufacturing ==> electrical equipment,1.0 BUSD,0.0 millions USD,None,1856
2206,2207.0,ZHUO JUN,6448,52 years old,Female,None,https://specials-images.forbesimg.com/imageser...,Manufacturing ==> printed circuit boards,1.0 BUSD,0.0 millions USD,None,1978
2207,2208.0,olguN ZOrlu,1860,54 years old,M,Turkey,https://specials-images.forbesimg.com/imageser...,Diversified ==> diversified,1.0 BUSD,nan millions USD,None,1978

# Challenge 2 - Working with JSON files

Import the pandas library.

In [161]:
# your code here
import pandas as pd

In the next cell, load the data in `nasa.json` in the `data` folder and load it into a pandas dataframe. Name the dataframe `nasa`.

In [162]:
# your code here
nasa= pd.read_json('/home/viki/Bootcamp/dataptmad1120/module-1/importing-exporting-data/data/nasa.json'
, orient='records')

Now that we have loaded the data, let's examine it using the `head()` function.

In [163]:
# your code here
nasa.head(10)

,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4,fall,geolocation,id,mass,name,nametype,recclass,reclat,reclong,year
0,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [6.08333, 50....",1,21.0,Aachen,Valid,L5,50.77500,6.08333,1880-01-01T00:00:00.000
1,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [10.23333, 56...",2,720.0,Aarhus,Valid,H6,56.18333,10.23333,1951-01-01T00:00:00.000
2,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-113, 54.216...",6,107000.0,Abee,Valid,EH4,54.21667,-113.00000,1952-01-01T00:00:00.000
3,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-99.9, 16.88...",10,1914.0,Acapulco,Valid,Acapulcoite,16.88333,-99.90000,1976-01-01T00:00:00.000
4,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.95, -33....",370,780.0,Achiras,Valid,L6,-33.16667,-64.95000,1902-01-01T00:00:00.000
5,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [71.8, 32.1]}",379,4239.0,Adhi Kot,Valid,EH4,32.10000,71.80000,1919-01-01T00:00:00.000
6,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [95.16667, 44...",390,910.0,Adzhi-Bogdo (stone),Valid,LL3-6,44.83333,95.16667,1949-01-01T00:00:00.000
7,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [0.61667, 44....",392,30000.0,Agen,Valid,H5,44.21667,0.61667,1814-01-01T00:00:00.000
8,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-65.23333, -...",398,1620.0,Aguada,Valid,L6,-31.60000,-65.23333,1930-01-01T00:00:00.000
9,NaN,NaN,Fell,"{'type': 'Point', 'coordinates': [-64.55, -30....",417,1440.0,Aguila Blanca,Valid,L,-30.86667,-64.55000,1920-01-01T00:00:00.000

#### The `value_counts()` function is commonly used in pandas to find the frequency of every value in a column.

In the cell below, use the `value_counts()` function to determine the frequency of all types of asteroid landings by applying the function to the `fall` column.

In [164]:
# your code here
nasa.value_counts('fall')

fall
Fell     996
Found      4
dtype: int64

Finally, let's save the dataframe as a json file again. Save the dataframe using the `orient=records` argument and name the file `nasa-output.json`. Remember to save the file inside the `data` folder.

In [165]:
# your code here
folder ='/home/viki/Bootcamp/dataptmad1120/module-1/importing-exporting-data/data'
nasa.to_json(f'{folder}/nasa-output.json', orient='records')

# Challenge 2 - Working with CSV and Other Separated Files

CSV files are more commonly used as dataframes. In the cell below, load the file from the URL provided using the `read_csv()` function in pandas. Starting version 0.19 of pandas, you can load a CSV file into a dataframe directly from a URL without having to load the file first and then transform it. The dataset we will be using contains information about NASA shuttles.

In the cell below, we define the column names and the URL of the data. Following this cell, read the tst file to a variable called `shuttle`. Since the file does not contain the column names, you must add them yourself using the column names declared in `cols` using the `names` argument. Additionally, a tst file is space separated, make sure you pass ` sep=' '` to the function.

In [166]:
cols = ['time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
tst_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/statlog/shuttle/shuttle.tst'

In [167]:
# your code here
shuttle = pd.read_csv(tst_url, names = cols, sep=' ')

Let's verify that this worked by looking at the `head()` function.

In [168]:
# your code here
shuttle.head()

,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
55,0,81,0,-6,11,25,88,64,4
56,0,96,0,52,-4,40,44,4,4
50,-1,89,-7,50,0,39,40,2,1
53,9,79,0,42,-2,25,37,12,4
55,2,82,0,54,-6,26,28,2,1

In [169]:
#It does not work correctly because there are 10 columns and only 9 titles in list 'cols'. The first column now is the row index.
#Thus I am going to add one more title ('code' for example) to obtain a row index of consecutive numbers.
cols_2 = ['code', 'time', 'rad_flow', 'fpv_close', 'fpv_open', 'high', 'bypass', 'bpv_close', 'bpv_open', 'class']
shuttle = pd.read_csv(tst_url, names = cols_2, sep=' ')
shuttle.head()

,code,time,rad_flow,fpv_close,fpv_open,high,bypass,bpv_close,bpv_open,class
0,55,0,81,0,-6,11,25,88,64,4
1,56,0,96,0,52,-4,40,44,4,4
2,50,-1,89,-7,50,0,39,40,2,1
3,53,9,79,0,42,-2,25,37,12,4
4,55,2,82,0,54,-6,26,28,2,1

To make life easier for us, let's turn this dataframe into a comma separated file by saving it using the `to_csv()` function. Save `shuttle` into the file `shuttle.csv` and ensure the file is comma separated, that we are not saving the index column and that the file is saved inside the `data` folder.

In [170]:
# your code here

shuttle.to_csv(f'{folder}/shuttle.csv', index=False, sep=',')

# Challenge 3 - Working with Excel Files

We can also use pandas to convert excel spreadsheets to dataframes. Let's use the `read_excel()` function. In this case, `astronauts.xls` is in the `data` folder. Read this file into a variable called `astronaut`. 

Note: Make sure to install the `xlrd` library if it is not yet installed.

In [171]:
# your code here
!conda install -y xlrd
!conda install -y openpyxl

astronaut = pd.read_excel('/home/viki/Bootcamp/dataptmad1120/module-1/importing-exporting-data/data/astronauts.xls')

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

Use the `head()` function to inspect the dataframe.

In [172]:
# your code here
astronaut.head()

,Name,Year,Group,Status,Birth Date,Birth Place,Gender,Alma Mater,Undergraduate Major,Graduate Major,Military Rank,Military Branch,Space Flights,Space Flight (hr),Space Walks,Space Walks (hr),Missions,Death Date,Death Mission
0,Joseph M. Acaba,2004.0,19.0,Active,1967-05-17,"Inglewood, CA",Male,University of California-Santa Barbara; Univer...,Geology,Geology,NaN,NaN,2,3307,2,13.0,"STS-119 (Discovery), ISS-31/32 (Soyuz)",NaT,NaN
1,Loren W. Acton,NaN,NaN,Retired,1936-03-07,"Lewiston, MT",Male,Montana State University; University of Colorado,Engineering Physics,Solar Physics,NaN,NaN,1,190,0,0.0,STS 51-F (Challenger),NaT,NaN
2,James C. Adamson,1984.0,10.0,Retired,1946-03-03,"Warsaw, NY",Male,US Military Academy; Princeton University,Engineering,Aerospace Engineering,Colonel,US Army (Retired),2,334,0,0.0,"STS-28 (Columbia), STS-43 (Atlantis)",NaT,NaN
3,Thomas D. Akers,1987.0,12.0,Retired,1951-05-20,"St. Louis, MO",Male,University of Missouri-Rolla,Applied Mathematics,Applied Mathematics,Colonel,US Air Force (Retired),4,814,4,29.0,"STS-41 (Discovery), STS-49 (Endeavor), STS-61 ...",NaT,NaN
4,Buzz Aldrin,1963.0,3.0,Retired,1930-01-20,"Montclair, NJ",Male,US Military Academy; MIT,Mechanical Engineering,Astronautics,Colonel,US Air Force (Retired),2,289,2,8.0,"Gemini 12, Apollo 11",NaT,NaN

Use the `value_counts()` function to find the most popular undergraduate major among all astronauts.

In [173]:
#The most popular undergraduate major is the one with the highest number counted.
display(astronaut.value_counts('Undergraduate Major'))

Undergraduate Major
Physics                           35
Aerospace Engineering             33
Mechanical Engineering            30
Aeronautical Engineering          28
Electrical Engineering            23
                                  ..
Earth Sciences                     1
Earth & Planetary Science          1
Music                              1
Computer & Systems Engineering     1
Accounting                         1
Length: 83, dtype: int64

Due to all the commas present in the cells of this file, let's save it as a tab separated csv file. In the cell below, save `astronaut` as a **tab separated file** using the `to_csv` function. Call the file `astronaut.csv`. Remember to remove the index column and save the file in the `data` folder.

In [174]:
# your code here
astronaut.to_csv(f'{folder}/astronaut.csv', sep='\t',index=False)

# Bonus Challenge - Fertility Dataset

Visit the following [URL](https://archive.ics.uci.edu/ml/datasets/Fertility) and retrieve the dataset as well as the column headers. Determine the correct separator and read the file into a variable called `fertility`. Examine the dataframe using the `head()` function. 

Look in Google for a way to retrieve this data!

In [175]:
#The file "fertility_Diagnosis.txt has been download to my data folder"
#The following data represents the columns headers:

#Season in which the analysis was performed. 1) winter, 2) spring, 3) Summer, 4) fall. (-1, -0.33, 0.33, 1)
#Age at the time of analysis. 18-36 (0, 1)
#Childish diseases (ie , chicken pox, measles, mumps, polio) 1) yes, 2) no. (0, 1)
#Accident or serious trauma 1) yes, 2) no. (0, 1)
#Surgical intervention 1) yes, 2) no. (0, 1)
#High fevers in the last year 1) less than three months ago, 2) more than three months ago, 3) no. (-1, 0, 1)
#Frequency of alcohol consumption 1) several times a day, 2) every day, 3) several times a week, 4) once a week, 5) hardly ever or never (0, 1)
#Smoking habit 1) never, 2) occasional 3) daily. (-1, 0, 1)
#Number of hours spent sitting per day ene-16 (0, 1)
#Output: Diagnosis normal (N), altered (O)

#I'm going to create a list with these columns headers:
column_headers = ['Season', 'Age', 'Diseases', 'Accident/Trauma', 'Surgical_Intervention', 'Fevers', 'Alcohol_consumption','Smoking','Siting_hours_per_day', 'Output_diagnosis']

#To convert the data in DataFrame:
fertility = pd.read_csv('/home/viki/Data/fertility_Diagnosis.txt', sep=",", names=column_headers)
fertility.head()

,Season,Age,Diseases,Accident/Trauma,Surgical_Intervention,Fevers,Alcohol_consumption,Smoking,Siting_hours_per_day,Output_diagnosis
0,-0.33,0.69,0,1,1,0,0.8,0,0.88,N
1,-0.33,0.94,1,0,1,0,0.8,1,0.31,O
2,-0.33,0.50,1,0,0,0,1.0,-1,0.50,N
3,-0.33,0.75,0,1,1,0,1.0,-1,0.38,N
4,-0.33,0.67,1,1,0,0,0.8,-1,0.50,O